src/cf/Documents/ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПланированиеПродажПоПотенциальнымТорговымТочкамОбои</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеПланированияПродажОбои</xr:Item>
				<xr:Item>InformationRegister.КомментарииКПланированиюПродажПлитка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТТ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПолок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцДостиженияЦели</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПланированияПродажОбои.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПланированияПродажОбои</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПолок1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолок05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборотСПолки1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборотСПолки05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаПлана1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаПлана05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаПланаДТН1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаПланаДТН05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>План1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>План05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распродажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоSKUПереоценка1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоSKUПереоценка05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркетингIndoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркетингOutdoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Акции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Образцы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корзины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркетингIndoorСвыше100</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представительские</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрочийМаркетинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУценки1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУценки05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена05</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРаспродажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеСтарое</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Comment>Для потенциальных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПотенциальнойТорговойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПланированиеПродажПоПотенциальнымТорговымТочкамОбои/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
		               |	КОНЕЦ КАК Город,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок КАК КоличествоПолок1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот КАК ОборотСПолки1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок * ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот * (3 - ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели + МЕСЯЦ(ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования)) КАК План1,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
		               |	КОНЕЦ КАК ТорговаяТочка,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
		               // +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Менеджер КАК Автор,
					   // --- VOG Кулаков П.Л.
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК Сценарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК Версия,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели КАК Месяц,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТорговойТочки,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки
		               |				И ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка <> ЗНАЧЕНИЕ(Справочник.вогТорговыеТочки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.Партнер
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент
		               |	КОНЕЦ КАК Клиент
		               |ИЗ
		               |	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
		               |ГДЕ
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
		               |	КОНЕЦ КАК Город,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок КАК КоличествоПолок1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот КАК ОборотСПолки1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок * ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот * (13 - ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели) КАК План1,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
		               |	КОНЕЦ КАК ТорговаяТочка,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
					   // +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Менеджер КАК Автор,
					   // --- VOG Кулаков П.Л.
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК Сценарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК Версия,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели КАК Месяц,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТорговойТочки,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент КАК Клиент
		               |ИЗ
		               |	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
		               |ГДЕ
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Движения.ДанныеПланированияПродажОбои.Загрузить(Запрос.Выполнить().Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Запись из Движения.ДанныеПланированияПродажОбои цикл
		
		// +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		Если Запись.Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
			Запись.Автор = Автор;
		КонецЕсли;
		// --- VOG Кулаков П.Л.
		
		// +++ VOG Кулаков П.Л. 26.03.2021
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Запись.Автор.Подразделение);
		
		Если ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
			ПодразделениеТорговойТочки = РегистрыСведений.ПодразделенияТорговыхТочек.ПолучитьПодразделениеТорговойТочки(Запись.ТорговаяТочка,Справочники.НаправленияДеятельности.Обои);
			Если ПодразделениеТорговойТочки <> Неопределено Тогда
				МенеджерТорговойТочки = РегистрыСведений.вогМенеджерыОбъектов.ПолучитьМенеджераТорговойТочки(Запись.ТорговаяТочка,ПодразделениеТорговойТочки,Справочники.НаправленияДеятельности.Обои);
				Если МенеджерТорговойТочки <> Неопределено Тогда
					Запись.Автор = МенеджерТорговойТочки;
					Запись.Подразделение = ПодразделениеТорговойТочки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// --- VOG Кулаков П.Л.
		
	КонецЦикла;
	
	Движения.ДанныеПланированияПродажОбои.Записывать=Истина;
	
	// +++ VOG Кулаков П.Л. 19.03.2021
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои) КАК НаправлениеДеятельности,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
	|	КОНЕЦ КАК ТорговаяТочка,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТТ,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки
	|				И ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка <> ЗНАЧЕНИЕ(Справочник.вогТорговыеТочки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.Партнер
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент
	|	КОНЕЦ КАК Клиент,
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК ВерсияСценария,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования
	// --- VOG Кулаков П.Л.
	|ИЗ
	|	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
	|ГДЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	
	Движения.КомментарииКПланированиюПродажПлитка.Загрузить(Запрос.Выполнить().Выгрузить());
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	Для Каждого Запись из Движения.КомментарииКПланированиюПродажПлитка цикл
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Автор.Подразделение);
		
		Если ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
			ПодразделениеТорговойТочки = РегистрыСведений.ПодразделенияТорговыхТочек.ПолучитьПодразделениеТорговойТочки(Запись.ТорговаяТочка,Справочники.НаправленияДеятельности.Обои);
			Если ПодразделениеТорговойТочки <> Неопределено Тогда
				МенеджерТорговойТочки = РегистрыСведений.вогМенеджерыОбъектов.ПолучитьМенеджераТорговойТочки(Запись.ТорговаяТочка,ПодразделениеТорговойТочки,Справочники.НаправленияДеятельности.Обои);
				Если МенеджерТорговойТочки <> Неопределено Тогда
					Запись.Подразделение = ПодразделениеТорговойТочки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// --- VOG Кулаков П.Л.
	Движения.КомментарииКПланированиюПродажПлитка.Записывать = Истина;
	
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из ДанныеПланирования цикл
		Если Строка.УИД="" тогда
			Строка.УИД = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	
	Для каждого Строка из ДанныеПланирования цикл
		
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Магазин_Палитра_ваших_стен или строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Магазин_Палитра_Плюс или
			строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Новый_магазин_клиента_без_бренд_зоны тогда
			Если НЕ ЗначениеЗаполнено(Строка.Город) тогда
				Отказ = Истина;
				Сообщить("В строке " + Строка.НомерСтроки + " не указан город");
			КонецЕсли;
		КонецЕсли;
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.НоваяБрендЗонаВСуществующейТТ и Не ЗначениеЗаполнено(Строка.ТорговаяТочка) тогда
			Отказ = Истина;
			Сообщить("В строке " + Строка.НомерСтроки + " не указана торговая точка");
		КонецЕсли;
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Новый_магазин_клиента_без_бренд_зоны и Не ЗначениеЗаполнено(Строка.Клиент) тогда
			Отказ = Истина;
			Сообщить("В строке " + Строка.НомерСтроки + " не указан клиент");
		КонецЕсли;
		
		Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал тогда
			Если Строка.МесяцДостиженияЦели > (Месяц(ПериодПланирования)+2) тогда
				Отказ = Истина;
				Сообщить("В строке " + Строка.НомерСтроки + " выбран не верный месяц");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для каждого Строка из ДанныеПланирования цикл
		Строка.УИД = "";	
	КонецЦикла;
	
КонецПроцедуры
